{
    "overall": {
        "api_name": "loadtxt",
        "description": "Load data from a text file."
    },
    "parameter": {
        "fname": {
            "type": "file, str, or pathlib.Path",
            "description": "File, filename, or generator to read.  If the filename extension is .gz or .bz2, the file is first decompressed. Note that generators should return byte strings. "
        },
        "dtype": {
            "type": "data-type, optional",
            "description": "Data-type of the resulting array; default: float.  If this is a structured data-type, the resulting array will be 1-dimensional, and each row will be interpreted as an element of the array.  In this case, the number of columns used must match the number of fields in the data-type. "
        },
        "comments": {
            "type": "str or sequence of str, optional",
            "description": "The characters or list of characters used to indicate the start of a comment. None implies no comments. For backwards compatibility, byte strings will be decoded as ‘latin1’. The default is ‘#’. "
        },
        "delimiter": {
            "type": "str, optional",
            "description": "The string used to separate values. For backwards compatibility, byte strings will be decoded as ‘latin1’. The default is whitespace. "
        },
        "converters": {
            "type": "dict, optional",
            "description": "A dictionary mapping column number to a function that will parse the column string into the desired value.  E.g., if column 0 is a date string: converters = {0: datestr2num}.  Converters can also be used to provide a default value for missing data (but see also genfromtxt): converters = {3: lambda s: float(s.strip() or 0)}. Default: None. "
        },
        "skiprows": {
            "type": "int, optional",
            "description": "Skip the first skiprows lines, including comments; default: 0. "
        },
        "usecols": {
            "type": "int or sequence, optional",
            "description": "Which columns to read, with 0 being the first. For example, usecols = (1,4,5) will extract the 2nd, 5th and 6th columns. The default, None, results in all columns being read.  Changed in version 1.11.0: When a single column has to be read it is possible to use an integer instead of a tuple. E.g usecols = 3 reads the fourth column the same way as usecols = (3,) would.  "
        },
        "unpack": {
            "type": "bool, optional",
            "description": "If True, the returned array is transposed, so that arguments may be unpacked using x, y, z = loadtxt(...).  When used with a structured data-type, arrays are returned for each field.  Default is False. "
        },
        "ndmin": {
            "type": "int, optional",
            "description": "The returned array will have at least ndmin dimensions. Otherwise mono-dimensional axes will be squeezed. Legal values: 0 (default), 1 or 2.  New in version 1.6.0.  "
        },
        "encoding": {
            "type": "str, optional",
            "description": "Encoding used to decode the inputfile. Does not apply to input streams. The special value ‘bytes’ enables backward compatibility workarounds that ensures you receive byte arrays as results if possible and passes ‘latin1’ encoded strings to converters. Override this value to receive unicode arrays and pass strings as input to converters.  If set to None the system default is used. The default value is ‘bytes’.  New in version 1.14.0.  "
        },
        "max_rows": {
            "type": "int, optional",
            "description": "Read max_rows lines of content after skiprows lines. The default is to read all the lines.  New in version 1.16.0.  "
        }
    },
    "return": {
        "out": {
            "type": "ndarray",
            "description": "Data read from the text file. "
        }
    },
    "note": "Notes '"
}