{
    "overall": {
        "api_name": "einsum",
        "description": "Evaluates the Einstein summation convention on the operands."
    },
    "parameter": {
        "subscripts": {
            "type": "str",
            "description": "Specifies the subscripts for summation as comma separated list of subscript labels. An implicit (classical Einstein summation) calculation is performed unless the explicit indicator ‘-&gt;’ is included as well as subscript labels of the precise output form. "
        },
        "operands": {
            "type": "list of array_like",
            "description": "These are the arrays for the operation. "
        },
        "out": {
            "type": "ndarray, optional",
            "description": "If provided, the calculation is done into this array. "
        },
        "dtype": {
            "type": "{data-type, None}, optional",
            "description": "If provided, forces the calculation to use the data type specified. Note that you may have to also give a more liberal casting parameter to allow the conversions. Default is None. "
        },
        "order": {
            "type": "{‘C’, ‘F’, ‘A’, ‘K’}, optional",
            "description": "Controls the memory layout of the output. ‘C’ means it should be C contiguous. ‘F’ means it should be Fortran contiguous, ‘A’ means it should be ‘F’ if the inputs are all ‘F’, ‘C’ otherwise. ‘K’ means it should be as close to the layout as the inputs as is possible, including arbitrarily permuted axes. Default is ‘K’. "
        },
        "casting": {
            "type": "{‘no’, ‘equiv’, ‘safe’, ‘same_kind’, ‘unsafe’}, optional",
            "description": "Controls what kind of data casting may occur.  Setting this to ‘unsafe’ is not recommended, as it can adversely affect accumulations.   ‘no’ means the data types should not be cast at all. ‘equiv’ means only byte-order changes are allowed. ‘safe’ means only casts which can preserve values are allowed. ‘same_kind’ means only safe casts or casts within a kind, like float64 to float32, are allowed. ‘unsafe’ means any data conversions may be done.   Default is ‘safe’. "
        },
        "optimize": {
            "type": "{False, True, ‘greedy’, ‘optimal’}, optional",
            "description": "Controls if intermediate optimization should occur. No optimization will occur if False and True will default to the ‘greedy’ algorithm. Also accepts an explicit contraction list from the np.einsum_path function. See np.einsum_path for more details. Defaults to False. "
        }
    },
    "return": {
        "output": {
            "type": "ndarray",
            "description": "The calculation based on the Einstein summation convention. "
        }
    },
    "note": "In explicit mode, einsum provides further flexibility to compute other array operations that might not be considered classical Einstein summation operations, by disabling, or forcing summation over specified subscript labels. '"
}