{
    "overall": {
        "api_name": "var",
        "description": "Compute the variance along the specified axis."
    },
    "parameter": {
        "a": {
            "type": "array_like",
            "description": "Array containing numbers whose variance is desired.  If a is not an array, a conversion is attempted. "
        },
        "axis": {
            "type": "None or int or tuple of ints, optional",
            "description": "Axis or axes along which the variance is computed.  The default is to compute the variance of the flattened array.  New in version 1.7.0.  If this is a tuple of ints, a variance is performed over multiple axes, instead of a single axis or all the axes as before. "
        },
        "dtype": {
            "type": "data-type, optional",
            "description": "Type to use in computing the variance.  For arrays of integer type the default is float64; for arrays of float types it is the same as the array type. "
        },
        "out": {
            "type": "ndarray, optional",
            "description": "Alternate output array in which to place the result.  It must have the same shape as the expected output, but the type is cast if necessary. "
        },
        "ddof": {
            "type": "int, optional",
            "description": "“Delta Degrees of Freedom”: the divisor used in the calculation is N - ddof, where N represents the number of elements. By default ddof is zero. "
        },
        "keepdims": {
            "type": "bool, optional",
            "description": "If this is set to True, the axes which are reduced are left in the result as dimensions with size one. With this option, the result will broadcast correctly against the input array. If the default value is passed, then keepdims will not be passed through to the var method of sub-classes of ndarray, however any non-default value will be.  If the sub-class’ method does not implement keepdims any exceptions will be raised. "
        }
    },
    "return": {
        "variance": {
            "type": "ndarray, see dtype parameter above",
            "description": "If out=None, returns a new array containing the variance; otherwise, a reference to the output array is returned. "
        }
    },
    "note": "Notes '"
}